; ModuleID = 'xdp-dispatcher.c'
source_filename = "xdp-dispatcher.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.xdp_dispatcher_config = type { i8, i8, i8, i8, [10 x i32], [10 x i32], [10 x i32] }

@conf = internal constant %struct.xdp_dispatcher_config zeroinitializer, align 4, !dbg !0
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !15
@dispatcher_version = dso_local global ptr null, section "xdp_metadata", align 8, !dbg !21
@llvm.compiler.used = appending global [4 x ptr] [ptr @_license, ptr @dispatcher_version, ptr @xdp_dispatcher, ptr @xdp_pass], section "llvm.metadata"

; Function Attrs: nofree noinline nounwind memory(inaccessiblemem: readwrite)
define dso_local i32 @prog0(ptr noundef readnone %0) local_unnamed_addr #0 !dbg !52 {
  %2 = alloca i32, align 4
  call void @llvm.dbg.value(metadata ptr %0, metadata !65, metadata !DIExpression()), !dbg !68
  call void @llvm.lifetime.start.p0(i64 4, ptr nonnull %2), !dbg !69
  call void @llvm.dbg.declare(metadata ptr %2, metadata !66, metadata !DIExpression()), !dbg !70
  store volatile i32 31, ptr %2, align 4, !dbg !70, !tbaa !71
  %3 = icmp eq ptr %0, null, !dbg !75
  br i1 %3, label %6, label %4, !dbg !77

4:                                                ; preds = %1
  %5 = load volatile i32, ptr %2, align 4, !dbg !78, !tbaa !71
  br label %6, !dbg !79

6:                                                ; preds = %1, %4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "conf", scope: !2, file: !3, line: 20, type: !28, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 16.0.6 (15)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp-dispatcher.c", directory: "/home/miguel/xdp-tools/lib/libxdp", checksumkind: CSK_MD5, checksum: "b6ed117e39c1c72628611da72a4d5f5d")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 5933, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../headers/linux/bpf.h", directory: "/home/miguel/xdp-tools/lib/libxdp", checksumkind: CSK_MD5, checksum: "19e7a278dd5e69adb087c419977e86e0")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !{!15, !21, !0}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 199, type: !17, isLocal: false, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32, elements: !19)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !{!20}
!20 = !DISubrange(count: 4)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "dispatcher_version", scope: !2, file: !3, line: 200, type: !23, isLocal: false, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !26)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !{!27}
!27 = !DISubrange(count: 2)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_dispatcher_config", file: !31, line: 24, size: 992, elements: !32)
!31 = !DIFile(filename: "../../headers/xdp/prog_dispatcher.h", directory: "/home/miguel/xdp-tools/lib/libxdp", checksumkind: CSK_MD5, checksum: "aaec112d5bc5c2d2bb62c79d8f95df8a")
!32 = !{!33, !37, !38, !39, !40, !45, !46}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !30, file: !31, line: 25, baseType: !34, size: 8)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !35, line: 21, baseType: !36)
!35 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "dispatcher_version", scope: !30, file: !31, line: 26, baseType: !34, size: 8, offset: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "num_progs_enabled", scope: !30, file: !31, line: 27, baseType: !34, size: 8, offset: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "is_xdp_frags", scope: !30, file: !31, line: 28, baseType: !34, size: 8, offset: 24)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "chain_call_actions", scope: !30, file: !31, line: 29, baseType: !41, size: 320, offset: 32)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 320, elements: !43)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !35, line: 27, baseType: !7)
!43 = !{!44}
!44 = !DISubrange(count: 10)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "run_prios", scope: !30, file: !31, line: 30, baseType: !41, size: 320, offset: 352)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "program_flags", scope: !30, file: !31, line: 31, baseType: !41, size: 320, offset: 672)
!47 = !{i32 7, !"Dwarf Version", i32 5}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = !{i32 1, !"wchar_size", i32 4}
!50 = !{i32 7, !"frame-pointer", i32 2}
!51 = !{!"Ubuntu clang version 16.0.6 (15)"}
!52 = distinct !DISubprogram(name: "prog0", scope: !3, file: !3, line: 26, type: !53, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !64)
!53 = !DISubroutineType(types: !54)
!54 = !{!25, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5944, size: 192, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !6, line: 5945, baseType: !42, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !56, file: !6, line: 5946, baseType: !42, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !56, file: !6, line: 5947, baseType: !42, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !56, file: !6, line: 5949, baseType: !42, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !56, file: !6, line: 5950, baseType: !42, size: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !56, file: !6, line: 5952, baseType: !42, size: 32, offset: 160)
!64 = !{!65, !66}
!65 = !DILocalVariable(name: "ctx", arg: 1, scope: !52, file: !3, line: 26, type: !55)
!66 = !DILocalVariable(name: "ret", scope: !52, file: !3, line: 27, type: !67)
!67 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!68 = !DILocation(line: 0, scope: !52)
!69 = !DILocation(line: 27, column: 9, scope: !52)
!70 = !DILocation(line: 27, column: 22, scope: !52)
!71 = !{!72, !72, i64 0}
!72 = !{!"int", !73, i64 0}
!73 = !{!"omnipotent char", !74, i64 0}
!74 = !{!"Simple C/C++ TBAA"}
!75 = !DILocation(line: 29, column: 14, scope: !76)
!76 = distinct !DILexicalBlock(scope: !52, file: !3, line: 29, column: 13)
!77 = !DILocation(line: 29, column: 13, scope: !52)
!78 = !DILocation(line: 31, column: 16, scope: !52)
!79 = !DILocation(line: 31, column: 9, scope: !52)
!80 = !DILocation(line: 32, column: 1, scope: !52)
!81 = distinct !DISubprogram(name: "prog1", scope: !3, file: !3, line: 34, type: !53, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !82)
!82 = !{!83, !84}
!83 = !DILocalVariable(name: "ctx", arg: 1, scope: !81, file: !3, line: 34, type: !55)
!84 = !DILocalVariable(name: "ret", scope: !81, file: !3, line: 35, type: !67)
!85 = !DILocation(line: 0, scope: !81)
!86 = !DILocation(line: 35, column: 9, scope: !81)
!87 = !DILocation(line: 35, column: 22, scope: !81)
!88 = !DILocation(line: 37, column: 14, scope: !89)
!89 = distinct !DILexicalBlock(scope: !81, file: !3, line: 37, column: 13)
!90 = !DILocation(line: 37, column: 13, scope: !81)
!91 = !DILocation(line: 39, column: 16, scope: !81)
!92 = !DILocation(line: 39, column: 9, scope: !81)
!93 = !DILocation(line: 40, column: 1, scope: !81)
!94 = distinct !DISubprogram(name: "prog2", scope: !3, file: !3, line: 42, type: !53, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !95)
!95 = !{!96, !97}
!96 = !DILocalVariable(name: "ctx", arg: 1, scope: !94, file: !3, line: 42, type: !55)
!97 = !DILocalVariable(name: "ret", scope: !94, file: !3, line: 43, type: !67)
!98 = !DILocation(line: 0, scope: !94)
!99 = !DILocation(line: 43, column: 9, scope: !94)
!100 = !DILocation(line: 43, column: 22, scope: !94)
!101 = !DILocation(line: 45, column: 14, scope: !102)
!102 = distinct !DILexicalBlock(scope: !94, file: !3, line: 45, column: 13)
!103 = !DILocation(line: 45, column: 13, scope: !94)
!104 = !DILocation(line: 47, column: 16, scope: !94)
!105 = !DILocation(line: 47, column: 9, scope: !94)
!106 = !DILocation(line: 48, column: 1, scope: !94)
!107 = distinct !DISubprogram(name: "prog3", scope: !3, file: !3, line: 50, type: !53, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !108)
!108 = !{!109, !110}
!109 = !DILocalVariable(name: "ctx", arg: 1, scope: !107, file: !3, line: 50, type: !55)
!110 = !DILocalVariable(name: "ret", scope: !107, file: !3, line: 51, type: !67)
!111 = !DILocation(line: 0, scope: !107)
!112 = !DILocation(line: 51, column: 9, scope: !107)
!113 = !DILocation(line: 51, column: 22, scope: !107)
!114 = !DILocation(line: 53, column: 14, scope: !115)
!115 = distinct !DILexicalBlock(scope: !107, file: !3, line: 53, column: 13)
!116 = !DILocation(line: 53, column: 13, scope: !107)
!117 = !DILocation(line: 55, column: 16, scope: !107)
!118 = !DILocation(line: 55, column: 9, scope: !107)
!119 = !DILocation(line: 56, column: 1, scope: !107)
!120 = distinct !DISubprogram(name: "prog4", scope: !3, file: !3, line: 58, type: !53, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !121)
!121 = !{!122, !123}
